axis2-war/src/test/resources/TestSoapHeader2/HelloWorld2.wsdl

<?xml version="1.0" encoding="utf-8" ?>
<!--
  ~ Licensed to the Apache Software Foundation (ASF) under one
  ~ or more contributor license agreements.  See the NOTICE file
  ~ distributed with this work for additional information
  ~ regarding copyright ownership.  The ASF licenses this file
  ~ to you under the Apache License, Version 2.0 (the
  ~ "License"); you may not use this file except in compliance
  ~ with the License.  You may obtain a copy of the License at
  ~
  ~    http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->

<wsdl:definitions 
    targetNamespace="http://ode/bpel/unit-test.wsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:tns="http://ode/bpel/unit-test.wsdl"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
   

   <wsdl:types>
      <xsd:schema targetNamespace="http://ode/bpel/unit-test.wsdl" 
        attributeFormDefault="qualified" elementFormDefault="qualified">
      <xsd:include schemaLocation="hello.xsd"/>
      </xsd:schema> 
   </wsdl:types>
   
    <wsdl:message name="HelloMessage">
        <wsdl:part name="TestPart" element="tns:body"/>
    </wsdl:message>
    
    <wsdl:message name="headers">
        <wsdl:part name="h1" element="tns:header1"/>
        <wsdl:part name="h2" element="tns:header2"/>        
    </wsdl:message>
        
    <wsdl:portType name="HelloPortType">
        <wsdl:operation name="hello">
            <wsdl:input message="tns:HelloMessage" name="TestIn"/>
            <wsdl:output message="tns:HelloMessage" name="TestOut"/>
        </wsdl:operation>    
    </wsdl:portType>
    
     <wsdl:binding name="HelloSoapBinding" type="tns:HelloPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="hello">
            <soap:operation soapAction=""/>
            <wsdl:input>
                <soap:header message="tns:headers" use="literal" part="h1"/>
                <soap:header message="tns:headers" use="literal" part="h2"/>            
                <soap:body parts="TestPart" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    
    <wsdl:service name="HelloService">
		<wsdl:port name="HelloPort" binding="tns:HelloSoapBinding">
     		<soap:address location="http://localhost:4000/please_externalize_url_in_endpoint_file"/>
		</wsdl:port>
    </wsdl:service>
    
   <plnk:partnerLinkType name="HelloPartnerLinkType">
       <plnk:role name="me" portType="tns:HelloPortType"/>
       <plnk:role name="you" portType="tns:HelloPortType"/>
   </plnk:partnerLinkType>
   
</wsdl:definitions>

