axis2/src/test/resources/HelloWorldRequest.soap

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <!-- test soap message -->
  <SOAP-ENV:Body>
    <ns1:hello xmlns:ns1="http://ode/bpel/unit-test.wsdl">
        <TestPart xmlns="" xmlns:foo="urn:/bar">ns1:Hello</TestPart>
    </ns1:hello>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
